; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v3 ?v11)
             (pred_5 ?v13 ?v9)
             (pred_7 ?v3 ?v9)
             (pred_4 ?v7 ?v3 )
	     (pred_6 ?v3)
             (pred_9 ?v6)
             (pred_3 ?v13)
             (pred_8 ?v9)
             (pred_1 ?v3)
             (pred_10 ?v13)
             (pred_2 ?v3)
             (pred_11 ))



(:action op_2
:parameters (?v4 ?v1 ?v12 ?v2)
:precondition (and (pred_9 ?v4) (pred_9 ?v1) (pred_3 ?v12) (pred_8 ?v2)
          (pred_12 ?v4 ?v1) (pred_5 ?v12 ?v2)
                   (pred_7 ?v1 ?v2) (pred_6 ?v4) 
                   (pred_1 ?v1) (pred_10 ?v12))
:effect (and  (pred_2 ?v1) (not (pred_1 ?v1))))


(:action op_3
:parameters (?v4 ?v5)
:precondition (and (pred_9 ?v4) (pred_9 ?v5)
               (pred_6 ?v4) (pred_12 ?v4 ?v5) (pred_2 ?v5))
:effect (and (pred_6 ?v5) (not (pred_6 ?v4))))

(:action op_4
:parameters (?v4 ?v12)
:precondition (and (pred_9 ?v4) (pred_3 ?v12) 
                  (pred_6 ?v4) (pred_4 ?v12 ?v4) (pred_11 ))
:effect (and (pred_10 ?v12)
   (not (pred_4 ?v12 ?v4)) (not (pred_11 ))))


(:action op_5
:parameters (?v4 ?v10 ?v8)
:precondition (and (pred_9 ?v4) (pred_3 ?v10) (pred_3 ?v8)
                  (pred_6 ?v4) (pred_10 ?v8) (pred_4 ?v10 ?v4))
:effect (and (pred_10 ?v10) (pred_4 ?v8 ?v4)
        (not (pred_10 ?v8)) (not (pred_4 ?v10 ?v4))))

(:action op_1
:parameters (?v4 ?v12)
:precondition (and (pred_9 ?v4) (pred_3 ?v12) 
                  (pred_6 ?v4) (pred_10 ?v12))
:effect (and (pred_11 ) (pred_4 ?v12 ?v4) (not (pred_10 ?v12)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_17 obj_07 obj_06 obj_12 obj_01 obj_18 obj_09 obj_11 obj_08 obj_14 obj_10 obj_04 obj_20 obj_15 obj_03 obj_19
    obj_16 obj_13
    obj_05 obj_02
    )

    (:init
       (pred_11)

       (pred_9 obj_17)
       (pred_9 obj_07)
       (pred_9 obj_06)
       (pred_9 obj_12)
       (pred_9 obj_01)
       (pred_9 obj_18)
       (pred_9 obj_09)
       (pred_9 obj_11)
       (pred_9 obj_08)
       (pred_9 obj_14)
       (pred_9 obj_10)
       (pred_9 obj_04)
       (pred_9 obj_20)
       (pred_9 obj_15)
       (pred_9 obj_03)
       (pred_9 obj_19)
       (pred_8 obj_16)
       (pred_8 obj_13)
       (pred_3 obj_05)
       (pred_3 obj_02)

       (pred_12 obj_17 obj_01)
       (pred_12 obj_17 obj_07)
       (pred_12 obj_07 obj_18)
       (pred_12 obj_07 obj_06)
       (pred_12 obj_07 obj_17)
       (pred_12 obj_06 obj_09)
       (pred_12 obj_06 obj_12)
       (pred_12 obj_06 obj_07)
       (pred_12 obj_12 obj_11)
       (pred_12 obj_12 obj_06)
       (pred_12 obj_01 obj_08)
       (pred_12 obj_01 obj_18)
       (pred_12 obj_01 obj_17)
       (pred_12 obj_18 obj_14)
       (pred_12 obj_18 obj_09)
       (pred_12 obj_18 obj_07)
       (pred_12 obj_18 obj_01)
       (pred_12 obj_09 obj_10)
       (pred_12 obj_09 obj_11)
       (pred_12 obj_09 obj_06)
       (pred_12 obj_09 obj_18)
       (pred_12 obj_11 obj_04)
       (pred_12 obj_11 obj_12)
       (pred_12 obj_11 obj_09)
       (pred_12 obj_08 obj_20)
       (pred_12 obj_08 obj_14)
       (pred_12 obj_08 obj_01)
       (pred_12 obj_14 obj_15)
       (pred_12 obj_14 obj_10)
       (pred_12 obj_14 obj_18)
       (pred_12 obj_14 obj_08)
       (pred_12 obj_10 obj_03)
       (pred_12 obj_10 obj_04)
       (pred_12 obj_10 obj_09)
       (pred_12 obj_10 obj_14)
       (pred_12 obj_04 obj_19)
       (pred_12 obj_04 obj_11)
       (pred_12 obj_04 obj_10)
       (pred_12 obj_20 obj_15)
       (pred_12 obj_20 obj_08)
       (pred_12 obj_15 obj_03)
       (pred_12 obj_15 obj_14)
       (pred_12 obj_15 obj_20)
       (pred_12 obj_03 obj_19)
       (pred_12 obj_03 obj_10)
       (pred_12 obj_03 obj_15)
       (pred_12 obj_19 obj_04)
       (pred_12 obj_19 obj_03)
       (pred_1 obj_17)
       (pred_1 obj_15)
       (pred_7  obj_17 obj_16)
       (pred_7  obj_15 obj_13)
       (pred_2 obj_07)
       (pred_2 obj_06)
       (pred_2 obj_12)
       (pred_2 obj_01)
       (pred_2 obj_18)
       (pred_2 obj_09)
       (pred_2 obj_11)
       (pred_2 obj_08)
       (pred_2 obj_14)
       (pred_2 obj_10)
       (pred_2 obj_04)
       (pred_2 obj_20)
       (pred_2 obj_03)
       (pred_2 obj_19)

       (pred_5  obj_05 obj_16)
       (pred_5  obj_02 obj_13)
       (pred_4 obj_05 obj_04)
       (pred_4 obj_02 obj_06)
       (pred_6 obj_09)
    )

    (:goal (and
       (pred_4 obj_05 obj_08)
       (pred_4 obj_02 obj_20)
    ))
(:constraints
  (always (not (pred_6 obj_18)))
)
)

; plan
1. (op_3 obj_09 obj_10)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_10)
   goals met: 0 of 2
2. (op_3 obj_10 obj_04)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_04)
   goals met: 0 of 2
3. (op_4 obj_04 obj_05)
   deleted: (pred_4 obj_05 obj_04) (pred_11)
   added: (pred_10 obj_05)
   goals met: 0 of 2
4. (op_3 obj_04 obj_10)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_10)
   goals met: 0 of 2
5. (op_3 obj_10 obj_14)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_14)
   goals met: 0 of 2
6. (op_3 obj_14 obj_08)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_08)
   goals met: 0 of 2
7. (op_1 obj_08 obj_05)
   deleted: (pred_10 obj_05)
   added: (pred_11) (pred_4 obj_05 obj_08)
   goals met: 1 of 2
8. (op_3 obj_08 obj_14)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_14)
   goals met: 1 of 2
9. (op_3 obj_14 obj_10)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_10)
   goals met: 1 of 2
10. (op_3 obj_10 obj_09)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_09)
   goals met: 1 of 2
11. (op_3 obj_09 obj_06)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_06)
   goals met: 1 of 2
12. (op_4 obj_06 obj_02)
   deleted: (pred_4 obj_02 obj_06) (pred_11)
   added: (pred_10 obj_02)
   goals met: 1 of 2
13. (op_3 obj_06 obj_09)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_09)
   goals met: 1 of 2
14. (op_3 obj_09 obj_10)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_10)
   goals met: 1 of 2
15. (op_3 obj_10 obj_14)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_14)
   goals met: 1 of 2
16. (op_3 obj_14 obj_08)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_08)
   goals met: 1 of 2
17. (op_3 obj_08 obj_20)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_20)
   goals met: 1 of 2
18. (op_1 obj_20 obj_02)
   deleted: (pred_10 obj_02)
   added: (pred_11) (pred_4 obj_02 obj_20)
   goals met: 2 of 2
